Configuration/src/Documents/Sales/Sales.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Sales</name>
  <tabularSections>
    <name>TabProducts</name>
    <attributes>
      <name>Products</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Cost</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Count</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Configuration/src/Documents/Sales/Forms/DocumentForm/Module.bsl
&AtClient
Procedure TabProductsCostOnChange(Item)
	РассчитатьСумму();
EndProcedure

&AtClient
Procedure TabProductsCountOnChange(Item)
	РассчитатьСумму();
EndProcedure

&AtClient
Procedure РассчитатьСумму()
	СтрокаТЧ = Элементы.TabProducts.ТекущиеДанные;
	СтрокаТЧ.Sum = СтрокаТЧ.Cost * СтрокаТЧ.Count;
EndProcedure

&AtClient
Procedure BeforeWrite(Cancel, WriteParameters)
	Object.Total = Object.TabProducts.Итог("Sum");
EndProcedure
